fresti/Test_Git_MCU/board/pin_mux.c
/*
 * The Clear BSD License
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v3.0
processor: MKL46Z256xxx4
package_id: MKL46Z256VLL4
mcu_data: ksdk2_0
processor_version: 0.0.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/


/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '35', peripheral: UART0, signal: RX, pin_signal: TSI0_CH2/PTA1/UART0_RX/TPM2_CH0}
  - {pin_num: '36', peripheral: UART0, signal: TX, pin_signal: TSI0_CH3/PTA2/UART0_TX/TPM2_CH1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA1 (pin 35) is configured as UART0_RX */
    PORT_SetPinMux(PORTA, 1U, kPORT_MuxAlt2	);

    /* PORTA2 (pin 36) is configured as UART0_TX */
    PORT_SetPinMux(PORTA, 2U, kPORT_MuxAlt2);


    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTA1 (pin 35) is configured as UART1_RX */
    PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt3);

    /* PORTA2 (pin 36) is configured as UART1_TX */
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt3);

    CLOCK_EnableClock(kCLOCK_Uart1);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK)))

                  /* UART0 Transmit Data Source Select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

                  /* UART0 Receive Data Source Select: UART_RX pin. */
                  | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX));

    /*LED config*/
            CLOCK_EnableClock(kCLOCK_PortD);
            PORT_SetPinMux(PORTD, 6U, kPORT_MuxAsGpio);
            PORT_SetPinMux(PORTD, 7U, kPORT_MuxAsGpio);


    /* MC60 pins */
            CLOCK_EnableClock(kCLOCK_PortB);
            PORT_SetPinMux(PORTB, 0U, kPORT_MuxAsGpio); /* RI Signal */
            PORT_SetPinMux(PORTB, 1U, kPORT_MuxAsGpio);	/* DTR Signal */
            PORT_SetPinMux(PORTB, 2U, kPORT_MuxAsGpio);	/* DCD Signal */
            PORT_SetPinMux(PORTB, 3U, kPORT_MuxAsGpio);	/* RTS Signal */
            PORT_SetPinMux(PORTB, 16U, kPORT_MuxAsGpio);	/* CTS Signal */
            PORT_SetPinMux(PORTB, 17U, kPORT_MuxAsGpio);	/* PWRKEY Signal */

    /* I2C pins */

            CLOCK_EnableClock(kCLOCK_PortE);
            PORT_SetPinMux(PORTE, 0U, kPORT_MuxAlt6);	/* SDA Signal */
            PORT_SetPinMux(PORTE, 1U, kPORT_MuxAlt6);	/* SCA Signal */

}

void BOARD_I2C_ConfigurePins(void)
{
		port_pin_config_t pinConfig = {0};
	    pinConfig.pullSelect = kPORT_PullUp;
	    pinConfig.slewRate = kPORT_FastSlewRate;
	    pinConfig.passiveFilterEnable = kPORT_PassiveFilterDisable;
	    pinConfig.driveStrength = kPORT_LowDriveStrength;
	    pinConfig.mux = kPORT_MuxAlt6;
	    CLOCK_EnableClock(kCLOCK_PortE);
	    CLOCK_EnableClock(kCLOCK_I2c1);

	    PORT_SetPinConfig(PORTE, 0U, &pinConfig);
	    PORT_SetPinConfig(PORTE, 1U, &pinConfig);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
